Revit 2026 API

# FilterElementIdRule Class

---

A filter rule that operates on ElementId values in a Revit project.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBFilterValueRule Autodesk.Revit.DBFilterNumericValueRule Autodesk.Revit.DBFilterElementIdRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterElementIdRule : FilterNumericValueRule
```
```vb
Public Class FilterElementIdRule
	Inherits FilterNumericValueRule
```
```cpp
public ref class FilterElementIdRule : public FilterNumericValueRule
```
```fsharp
type FilterElementIdRule =
    class
        inherit FilterNumericValueRule
    end
```

The FilterElementIdRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterElementIdRule | Constructs an instance of FilterElementIdRule. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule) |
|  | RuleValue | The user-supplied value against which values from a Revit document will be tested. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from FilterRule) |
|  | ElementPasses | Derived classes override this method to implement the test that determines whether the given element passes this rule or not. (Inherited from FilterRule) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetEvaluator | Gets the evaluator that implements the test for this rule. (Inherited from FilterNumericValueRule) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRuleParameter | Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter. (Inherited from FilterRule) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetEvaluator | Sets the evaluator that implements the test for this rule. (Inherited from FilterNumericValueRule) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | UsesLevelFiltering | This function checks if a parameter uses level filtering. |

When GetRuleParameter returns a parameter that UsesLevelFiltering(Document, ElementId), then the comparisons will first compare the values of the levels' elevations, then compare the levels' names, and finally the levels' element ids to rank and sort the levels.

#### Reference

Autodesk.Revit.DB Namespace